title: Access to Password File
id: 12345678-1234-1234-1234-1234567890ab
status: experimental
description: Detects access to /etc/passwd or /etc/shadow
author: GalW
date: 2025/11/21
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        CommandLine|contains:
            - '/etc/passwd'
            - '/etc/shadow'
    condition: selection
level: critical
tags:
    - attack.credential_access
    - attack.t1003.008
